blog.org
#+STARTUP: content noindent showall
#+AUTHOR: Khayyam Saleem
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: t

*** DONE Moving to Hugo through Org
:post:tags:
CLOSED: [2018-12-25 Tue 8:00]
:PROPERTIES:
:EXPORT_DATE: 2018-12-25
:EXPORT_FILE_NAME: moving-to-hugo
:END:

I want to try this new blog format. Since I've really started to enjoy org-mode in emacs, and I think that the themes in [[http://gohugo.io][Hugo]] seemed pretty, this was a natural choice. *Will* post a tutorial about my blog creation and deployment soon. Just a test for now.

**** Source Blocks

Below is a demo of a source block and its execution.

#+BEGIN_SRC ocaml
  let rec fact_h x acc = match x with
    | 1 -> acc
    | n -> fact_h (n-1) (n*acc) in
      let fact y = fact_h y 1 in
      fact 5
#+END_SRC

#+RESULTS:
: 120

**** Tables

Here's a demo of an org-mode table:

| Index | Value |
|-------|-------|
|     0 |     1 |
|     1 |     1 |
|     2 |     2 |
|     3 |     6 |
|     4 |    24 |
|     5 |   120 |

